<?php
namespace FacebookBusiness\ErrorCode;

trait ErrorCodes {
	/**
	 * facebook基本错误代码翻译
	 *
	 * $codeConstant = [code => [subCode => 'errorMessage']]
	 * subCode=0时，表示fb接口未返回subcode，只有code
	 * @var array 错误
	 */
	protected array $codeConstant = [
		1 => [
			0 => '未知错误',
			99 => '级别设置错误'
		],
		4 => [
			0 => '已达到应用程序请求限制'
		],
		10 => [
			/**
			 * 应用程序无权执行此操作
			 * 帖子详情接口不存在数据会返回code=10
			 */
			0 => '找不到结果，请尝试搜索其他内容',
			1404163 => '你无法再使用 Facebook 产品进行推广。你无法投放广告、管理广告资产，或者新建广告帐户或商务管理平台帐户'
		],
		17 => [
			0 => '已达到用户请求限制'
		],
		100 => [
			0 => '无效的参数',

			/**
			 * 不支持的发布请求。
			 * 如果您的访问令牌未添加为对拥有自定义受众的广告帐户具有适当权限的系统用户，则可能会发生此错误。在Business Manager中验证广告帐户并验证所有系统用户在广告帐户下显示为Admin：
			 * 点击Business Settings
			 * 点击广告帐户
			 * 选择Add people
			 * 搜索系统用户并将其添加为管理员
			 * 重试 API 调用
			 */
			33 => '数据不存在',

			/**
			 * 无效的参数。
			 * 您选择的类别不再可用。一些基于行为的定位类别已被弃用。如果您尝试使用它们创建广告，您的请求将失败并返回此错误。使用定位搜索查看可用于定位的类别
			 */
			1487694 => '无效的参数',

			/**
			 * 无效的参数。
			不支持此任务组合。 要为此广告帐户分配有效功能的用户，您应该传入映射中定义的任务组合。 请参阅 Business Manager API，允许的角色
			 */
			1752129 => '无效的参数',
			1885364 => '缺少受众所在地信息',
			2446385 => '请选择至少一个受众国家/地区',
			1487497 => '已有创意使用了此素材，无法删除',
			2061015 => '网址为必填信息，请填写后再继续。',
			3260002 => '所有网域都需要关联一组 Pixel 像素代码事件配对和一条广告。如需发布这条广告，请先配置网域追踪，或在广告页面选择像素追踪进行发布。'
		],
		102 => [
			0 => '会话密钥无效'
		],
		104 => [
			0 => '签名不正确'
		],
		190 => [
			0 => '访问令牌无效'
		],
		200 => [
			0 => '权限错误',
			1870034 => '未同意自定义受众条款',
			1870047 => '受众规模太小',
			1815694 => '账号无操作权限',
		],

		/**
		 * 管理广告需要扩展权限“ads_management”和我们允许列表中的应用程序来访问营销 API
		 */
		294 => [
			0 => '无广告管理权限“'
		],
		2607 => [
			0 => '无效的货币'
		],
		2615 => [
			0 => '广告帐户更新失败'
		],
		2654 => [
			0 => '创建自定义受众失败',
			1713092 => '广告账号无创建受众权限',
			1713148 => '找不到有效位置，请重新选择',
		],
		5000 => [
			0 => '未知错误'
		],
		1349118 => [
			0 => '安全应用程序设置不允许一个或多个给定 URL。它必须与网站 URL 或画布 URL 匹配，或者域必须是应用程序域之一的子域'
		],
		1359036 => [
			0 => '账户已达到最大广告数量'
		],
		1359102 => [
			0 => '参数具有无效值或缺少必需的参数'
		],
		1487006 => [
			0 => '无效的广告系列ID'
		],
		1487007 => [
			0 => '广告活动已结束'
		],
		1487010 => [
			0 => '广告出价过高：您的出价高于其类型和展示位置的最大值。如果您想提高出价，请使用低于最大值的值'
		],
		1487013 => [
			0 => '出价过低：您的出价低于其展示位置和类型的最小值。如果您不希望您的广告以最低出价运行，请暂停它。否则，请将出价提高到建议范围内'
		],
		1487014 => [
			0 => '广告系列预算过低。请将每日预算至少提高到最高 CPC 广告出价的 2 倍'
		],
		1487015 => [
			0 => '广告素材无效'
		],
		1487065 => [
			0 => '广告缺少定位规范：广告规范需要定位规范。请使用定位字段来指定应向哪些受众展示广告。“国家”必填'
		],
		1487087 => [
			0 => '广告创建失败'
		],
		1487089 => [
			0 => '目标规范无效'
		],
		1487090 => [
			0 => '广告编辑失败'
		],
		1487108 => [
			0 => '无效城市'
		],
		1487124 => [
			0 => '无效连接'
		],
		1487133 => [
			0 => '无效的排除联系人'
		],
		1487172 => [
			0 => '无法保存广告素材'
		],
		1487174 => [
			0 => '无效的图像哈希'
		],
		1487194 => [
			0 => '权限错误'
		],
		1487199 => [
			0 => '广告定位与故事的定位不匹配'
		],
		1487202 => [
			0 => '无效对象'
		],
		1487211 => [
			0 => '广告素材目标的 URL 无效'
		],
		1487225 => [
			0 => '广告创作受限于每日支出：您在给定时间段内可以创建的广告数量有一个限制，具体取决于您的每日支出水平。更高的支出水平允许创建更多的广告。提高您的每日支出限额或在每个时间段内制作更少的广告'
		],
		1487244 => [
			0 => '广告系列更新失败'
		],
		1487246 => [
			0 => '广告系列创建失败'
		],
		1487256 => [
			0 => '政策限制，定位被拒绝：广告定位无效，目标规格被拒绝'
		],
		1487283 => [
			0 => '不允许使用视图标签'
		],
		1487301 => [
			0 => '自定义受众不可用'
		],
		1487346 => [
			0 => '帖子不属于此主页'
		],
		1487366 => [
			0 => '自定义受众已被删除'
		],
		1487376 => [
			0 => '需要转换规范：对于指向具有非零操作出价的场外位置的广告，您必须指定转换规范'
		],
		1487380 => [
			0 => '转化数据的聚合日期无效。聚合天数必须大于等于 1。'
		],
		1487390 => [
			0 => '创意创建失败'
		],
		1487391 => [
			0 => '无法使用来自多个合作伙伴的联合受众：为广告指定合作伙伴创建的自定义受众时，所有受众必须来自同一提供商'
		],
		1487396 => [
			0 => '未能更新广告素材'
		],
		1487424 => [
			0 => '广告需要排除定位：无法使用您选择的定位规范创建此广告'
		],
		1487465 => [
			0 => 'CPA 出价无效：您选择的操作类型不允许用于每次操作，请更改您的优化目标或将您的出价类型切换为常规优化后的每千次展示费用'
		],
		1487472 => [
			0 => '这种类型的页面帖子不符合推广的条件'
		],
		1487477 => [
			0 => '转化跟踪像素权限错误：您尝试使用的转化跟踪像素归其他用户所有，并且尚未与您共享'
		],
		1487485 => [
			0 => '异步请求太多'
		],
		1487506 => [
			0 => '新预算值过低'
		],
		1487557 => [
			0 => '活动更新失败'
		],
		1487558 => [
			0 => '广告更新失败'
		],
		1487559 => [
			0 => '广告更新失败'
		],
		1487573 => [
			0 => '广告未指定对象ID'
		],
		1487742 => [
			0 => '广告帐户请求过多。稍等片刻再试一次'
		],
		1487756 => [
			0 => '地理位置重叠。请删除一个以继续'
		],
		1487790 => [
			0 => '对象不存在'
		],
		1487881 => [
			0 => '覆盖率和频次广告系列中的给定预测 ID 不存在'
		],
		1487882 => [
			0 => '覆盖面和频次广告系列中的给定预订尚未最终确定'
		],
		1487884 => [
			0 => '覆盖面和频次广告系列中的给定预订已完成'
		],
		1487885 => [
			0 => '覆盖率和频率活动中的预测已被保留'
		],
		1487886 => [
			0 => '操作失败'
		],
		1487887 => [
			0 => '库存管理器不支持给定的页面类型'
		],
		1487915 => [
			0 => '最终的预测订单无法取消。您可以创建新的预测或删除活动'
		],
		1634013 => [
			0 => '无操作权限'
		],
		1667002 => [
			0 => '无法编辑此促销：因为您是从主页进行的。在您的主页上查找帖子以暂停、删除或更新此促销活动的预算'
		],
		1815826 => [
			0 => '您的竞价策略无效'
		],
		1815829 => [
			0 => '您正尝试在启用了广告系列预算优化的广告系列中为广告组设置出价策略。不允许在此类广告组上设置出价策略。删除广告组的出价策略或禁用广告系列的广告系列预算优化'
		],
		1815830 => [
			0 => '您正在尝试为不使用拍卖购买类型的广告活动中的广告组设置出价策略。不允许在此类广告组上设置出价策略'
		],
		1815857 => [
			0 => '请填写费用控制额'
		],
		1815858 => [
			0 => '竞价策略为最低费用，不用填写费用控制额'
		],
		1815067 => [
			0 => '优化目标不可用：您不能将选定的优化目标用于您的广告系列目标。请选择其他目标并修改您的广告系列'
		],
		1798130 => [
			0 => '请创建广告组'
		],
		2310025 => [
			0 => '无法使用此广告帐户创建活动'
		],
		2310039 => [
			0 => '您不能使用此广告帐户为此目录细分投放广告'
		],
		3260011 => [
			0 => '广告组发布后，您无法修改广告组的像素、转化事件、自定义转化或优化。要运行具有所需更改的广告组，请创建一个新的广告组'
		],
        80004 => [
            0 => '此广告帐户的调用次数过多。稍等片刻再试一次'
        ],
        368 => [
            0 => '尝试的操作已被视为滥用或以其他方式被禁止',
	        1404163 => '你无法再使用 Facebook 产品进行推广。你无法投放广告、管理广告资产，或者新建广告帐户或商务管理平台帐户'
        ],
        80000 => [
            0 => '此广告帐户的来电过多。稍等片刻再试一次'
        ],
        3018 => [
            0 => '时间范围的开始日期不能超过当前日期的 37 个月'
        ],
        270 => [
            0 => '具有开发权限级别的应用不允许此 Ads API 请求'
        ],
        278 => [
            0 => '阅读广告需要具有扩展权限 ads_read 的访问令牌'
        ],
        2642 => [
            0 => '无效的游标值'
        ],
        110 => [
            0 => '无效的用户 ID'
        ],
        3962 => [
            0 => '提供的许可无效'
        ],
        80003 => [
            0 => '此广告帐户的调用次数过多。稍等片刻再试一次'
        ],
        2663 => [
            0 => '服务条款未被接受。'
        ],
        2633 => [
            0 => '此共享登录已禁用'
        ],
        2667 => [
            0 => '您的帐户权限不允许您为此事件源创建自定义受众'
        ],
        2650 => [
            0 => '未能更新自定义受众'
        ],
        2656 => [
            0 => '无法删除自定义受众，因为存在关联的相似对象'
        ],
        2651 => [
            0 => '未能创建相似的自定义受众'
        ]

	];

	/**
	 * @param int $code
	 * @param int $subCode
	 * @param string $errorMessage
	 * @return string
	 */
	public function getErrorMessage(int $code, int $subCode, string $errorMessage = ''): string
	{

		return $this->codeConstant[$code][$subCode] ?? $errorMessage;

	}


}

